Courses/4420/Lectures/SecSoftware/Assertions/WP/wp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Dijkstra's Weakest Preconditions</title>
<!-- 2018-09-11 Tue 13:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="WSU CEG 7370 Distributed Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2016-09-08 | <a href="../../">../../</a>
</div>
<div id="content">
<h1 class="title">Dijkstra's Weakest Preconditions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Abstract</a></li>
<li><a href="#sec-2">2. Weakest Precondition</a></li>
<li><a href="#sec-3">3. wp Defined for a PL</a>
<ul>
<li><a href="#sec-3-1">3.1. Law of Excluded Miracle</a></li>
</ul>
</li>
<li><a href="#sec-4">4. wp Example Q/Answers</a>
<ul>
<li><a href="#sec-4-1">4.1. Weakest Preconditions-4</a></li>
<li><a href="#sec-4-2">4.2. Weakest Preconditions-5</a></li>
<li><a href="#sec-4-3">4.3. Weakest Preconditions-6</a></li>
</ul>
</li>
<li><a href="#sec-5">5. References</a></li>
<li><a href="#sec-6">6. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
This page is about wp(), without concurrency related issues.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Weakest Precondition</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Let R stand for wp(S, Q).  R is an assertion/ predicate/ condition.
R is a &lt;i&gt;weakest precondition&lt;/i&gt; if the following holds.
</li>

<li>For all states s that satisfy R, executing S on s always
terminates, and the resulting state s' satisfies Q.
</li>

<li>Hoare's triplet {wp(S, Q)} S {Q} is therefore True.
</li>

<li>Note that wp() is about total correctness: It includes termination.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> wp Defined for a PL</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>wp(skip, R) is R  // skip is is a "do nothing" statement
</li>
<li>wp(abort, R) is False   // abort is an "always fail" statement
</li>
<li>wp(x := e, R) is (R with x replaced by e)
</li>
<li>wp(S1; S2, R) is wp(S1, wp(S2, R))
</li>
<li>wp(if B then S1 else S2 fi,  R) is&lt;br&gt; ((B &rArr; wp(S1, R)) and (not B &rArr; wp(S2, R)))
</li>
<li>wp(while B do S od) is &#x2026;
</li>
</ol>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Law of Excluded Miracle</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>wp(S, False) = False is impossible.
</li>

<li>This is known as the Law of Excluded Miracle.  The phrase "is
impossible" can be confusing.  Understand it as "we cannot do it"
as in we cannot satisfy the precondition False, execute S, and
expect False to be True.  So, for any Q, wp(S, Q) = False is impossible.
</li>

<li>wp(S, True) = True?  Does this define liveness of S?
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> wp Example Q/Answers</h2>
<div class="outline-text-2" id="text-4">
<p>
Determine weakest preconditions of the following. Show <i>all</i>
intermediate steps. Assume that all variables are of integer type.  PL
code is shown enclosed in braces.  Note that CS literature uses := as
an assignment-operator, and = as equals.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Weakest Preconditions-4</h3>
<div class="outline-text-3" id="text-4-1">
<p>
wp( {n := n + m; m := n + m; n := m - n},  (n = 6) and (m =  1) )<br  />
= wp( {n := n + m; m := n + m}, (m - n = 6) and (m = 1) )<br  />
= wp( {n := n + m}, (n + m - n = 6) and (n + m = 1) )<br  />
= wp( {n := n + m}, (m = 6) and (n + m = 1) )<br  />
= (m = 6) and (n + m + m = 1)<br  />
= m = 6 and n = -11<br  />
</p>
</div>
</div>


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Weakest Preconditions-5</h3>
<div class="outline-text-3" id="text-4-2">
<p>
wp( {if  i &gt; j then i := i - j else j := i fi},  i = j )<br  />
= (i &gt; j &rArr; wp({i := i - j},i = j)) and (i &lt;= j &rArr; wp({j := i}, i = j))<br  />
= (i &gt; j &rArr; i - j = j) and (i &lt;= j &rArr; i = i)<br  />
= (i &gt; j &rArr; i = 2*j) and (i &gt; j or true)<br  />
= (i &lt;= j or i = 2*j) and (true)<br  />
= (i &lt;= j or i = 2*j)<br  />
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Weakest Preconditions-6</h3>
<div class="outline-text-3" id="text-4-3">
<p>
wp( {while i &gt; 3 do i := i - 3 od},  i = 3 )<br  />
</p>

<p>
P0 = (i &lt;= 3) and (i = 3) = (i = 3)<br  />
P1 = (i &gt; 3) and wp({i := i - 3}, i=3) = (i &gt; 3) and (i-3 = 3) = (i = 6)<br  />
P2 = (i &gt; 3) and wp({i := i - 3}, i=6) = (i &gt; 3) and (i-3 = 6) = (i = 9)<br  />
Pk = i = 3*(k+1)<br  />
</p>

<p>
wp( {while i &gt; 3 do i := i - 3 od},  i = 3 ) =  (P0 or &exist; k&gt;= 0: Pk)<br  />
= (i = 3 or (&exist; k &gt;= 0: i = 3 * (k + 1)))<br  />
= (&exist; k &gt;= 1: i = 3*k)<br  />
= i = 3*k, for some k &gt; 0<br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Dijkstra, Edsger Wybe, A Discipline of Programming. Englewood
Cliffs: prentice-hall, 217pp, 1976. A classic. Dijkstra is a Turing
award winner.
</li>
<li>See Andrews, Chapter 1.
</li>
<li><a href="http://en.wikipedia.org/wiki/Predicate_transformer_semantics">http://en.wikipedia.org/wiki/Predicate_transformer_semantics</a>
</li>
<li>Prabhaker Mateti, Lecture Notes on <a href="./assertions.html">Assertions</a>, 2016.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2016-09-08
</div>
</body>
</html>
